{
  "name": "runlist_modifiers",
  "description": "Provides run list modifications via node attributes",
  "long_description": "RunlistModifiers\n================\n\nThis cookbook provides helpers to allow or disallow recipes from being loaded\nvia the run list based on node attributes.\n\nRepository:\n----------\n\nhttps://github.com/heavywater/chef-runlist_modifiers\n\nAttributes:\n-----------\n\n* `node[:restricted_recipes] = %w(users::sysadmins)`\n* `node[:allowed_recipes] = %w(sudo)`\n\nThese are the two attributes available for modifying the run list. The\nbehavior of each is similar but slightly different.\n\nRestricted Recipes:\n-------------------\n\nRestricted recipes are recipes which are not allowed to be run. This means\nthat if a recipe in the run list depends on a recipe within the restricted\nrecipes setting, neither recipe will be loaded. \n\nAllowed Recipes:\n----------------\n\nAllowed recipes are recipes which are allowed to be loaded within the run\nlist. This is the important distinction between the restricted and allowed\nrecipes. The allowed recipes will remove any recipes execpt those specified\nfrom the initial run list. Any dependencies those recipes require will then\nbe free to be loaded. \n\nCombinations:\n-------------\n\nThese attributes can be combined. This means that if a recipe in the allowed\nrecipes depends on a recipe specified within the restricted recipes, it will\nnot be loaded. The restricted recipes always have precedence.\n\nHistory:\n--------\n\nSome history on the origins of this cookbook can be found here:\n\nhttp://lists.opscode.com/sympa/arc/chef-dev/2012-03/msg00022.html\n",
  "maintainer": "Chris Roberts",
  "maintainer_email": "chrisroberts.code@gmail.com",
  "license": "Apache 2.0",
  "platforms": {
  },
  "dependencies": {
  },
  "recommendations": {
  },
  "suggestions": {
  },
  "conflicting": {
  },
  "providing": {
  },
  "replacing": {
  },
  "attributes": {
  },
  "groupings": {
  },
  "recipes": {
  },
  "version": "0.1.2"
}